<template>
    <div class="root">
        <h2>数值计算101</h2>
        <p>一个目标函数需要的参数通常包括：本身的参数、基础乘区、角色面板、怪物面板和Buff。Buff在计算中起到重要的作用，一切命座、武器、圣遗物等特殊效果都应该在Buff中添加。如果计算器得到的数值和游戏数值不匹配，通常是Buff设置错误。</p>
        <p>Buff分为三大类：</p>
        <ul>
            <li>提升A</li>
            <li>基于A，提升B</li>
            <li>基于A，提升B，上限是C</li>
        </ul>
        <p>你会注意到实际上每一类都会分成两小类，带%后缀的和不带%后缀的。</p>
        <p>
            这是因为所有数值分为两类，
            <b>基本数值</b>
            和
            <b>百分比数值</b>
            。基础数值之间只能相加，结果还是基础数值；百分比数值之间可以相加相乘，结果都是百分比数值；基础数值和百分比数值之间只能相乘，结果是基础数值。
        </p>
        <p>仅有少量一级数值是基本数值，它们包括：加性常数、等级、攻/生/防、元素精通、体力。一级数值是指面板数值，二级数值是面板数值组合计算得到的数，例如基础乘区、抗性乘区等。</p>
        <p>除此之外还有一个特别的Buff，“提升攻生防 (%)”，它实际上是“基于基础攻生防，提升攻生防”的简写。</p>
        <p>
            大部分目标函数的取值是基础数值，它们一定包含且仅包含一个
            <b>基础乘区</b>，其余乘区都是百分比数值类型的乘区。
        </p>
        <p>默认情况下，基础乘区=倍率*攻/生/防+常数，但可以在Buff内提高。例如可以基于元素精通的x%提升基础乘区。</p>
        <h2>FAQ</h2>
        <p>
            <b>Q: 胡桃的E除了基于攻击力外，还和生命值有关，应该怎么设置？</b>
        </p>
        <p>A: 基础乘区填攻击力，在Buff中添加“基于生命值，提升基础乘区”。阿贝多二命、纺锤特效等同理。</p>
        <p>
            <b>Q: 怪物抗性减免、魔女套反应加成、全属性伤害加成在哪里设置？</b>
        </p>
        <p>A：Buff中。</p>
    </div>
</template>

<style scoped>
.root {
    width: 800px;
    max-width: 100%;
    margin-left: auto;
    margin-right: auto;
    padding: 20px;
    color: #444;
}
p {
    margin: 15px 0;
}
ul {
    margin-left: 30px;
}
</style>